Task 2 - susiesmith_2.ipynb

##Task 1. Create DataFrame

In [35]:
import pandas as pd

In [36]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

##Task 2. Custom Index

In [37]:
grades = pd.DataFrame(grades_dict)

In [38]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [39]:
grades.index = ['Test1', 'Test2', 'Test3']

In [40]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [41]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [42]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

##Task 3. Accessing Rows (loc,iloc)

In [43]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [44]:
grades.iloc[0]

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [45]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

##I prefer to use the loc to access the rows by name.

In [46]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

##Task 3.Accessing Subsets (at,iat)

In [47]:
grades.at['Test2', 'Eva']

87

In [48]:
grades.iat[2,0]

70

##Task 4.Describe (By Column)

In [49]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [50]:
pd.set_option('precision',2)

OptionError: Pattern matched multiple keys

In [ ]:
pd.set_option('display.precision',2)

In [51]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

##Task 5. Transpose (rows<-->columns)

In [52]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

In [53]:
import pandas as pd

In [54]:
grades=pd.DataFrame(grades_dict)

In [55]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [56]:
grades.mean()

Wally    84.333333
Eva      92.333333
Sam      87.000000
Katie    87.666667
Bob      77.666667
dtype: float64

In [57]:
grades.T

         0   1   2
Wally   87  96  70
Eva    100  87  90
Sam     94  77  90
Katie  100  81  82
Bob     83  65  85

In [58]:
grades.index = ['Test1', 'Test2', 'Test3']

In [59]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [60]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [61]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [62]:
grades.T.describe()

            Test1     Test2      Test3
count    5.000000   5.00000   5.000000
mean    92.800000  81.20000  83.400000
std      7.661593  11.54123   8.234076
min     83.000000  65.00000  70.000000
25%     87.000000  77.00000  82.000000
50%     94.000000  81.00000  85.000000
75%    100.000000  87.00000  90.000000
max    100.000000  96.00000  90.000000

##Task 6. Sort

In [63]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [64]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70